c5/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Export</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Import</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorItems</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorServices</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/OrganizationFields/Module.bsl
&AtServer
Procedure SetVendorAccount ( Object ) export
	
	accounts = AccountsMap.Organization ( Object.Vendor, Object.Company, "VendorAccount" );
	if ( ValueIsFilled ( accounts.VendorAccount ) ) then
		Object.VendorAccount = accounts.VendorAccount;
	endif; 
	
EndProcedure

&AtServer
Procedure SetCustomerAccount ( Object ) export
	
	accounts = AccountsMap.Organization ( Object.Customer, Object.Company, "CustomerAccount" );
	if ( ValueIsFilled ( accounts.CustomerAccount ) ) then
		Object.CustomerAccount = accounts.CustomerAccount;
	endif;
	
EndProcedure

&AtServer
Procedure SetVendorContract ( Object ) export

	fields = DF.Values ( Object.Vendor, "VendorContract, VendorContract.Company" );
	if ( fields.VendorContractCompany = Object.Company ) then
		if ( not fields.VendorContract.IsEmpty () ) then
			Object.Contract = fields.VendorContract;
		endif; 
	else
		Object.Contract = Catalogs.Contracts.EmptyRef ();
	endif; 
	
EndProcedure

&AtServer
Procedure SetCurrency ( Form ) export

	object = Form.Object;
	fields = DF.Pick ( object.Contract, "Currency" );
	Form.ContractCurrency = fields.Currency;
	data = CurrenciesSrv.Get ( fields.Currency, object.Date );
	object.Currency = fields.Currency;
	object.Rate = data.Rate;
	object.Factor = data.Factor;
	
EndProcedure

&AtServer
Procedure SetVendorImportCurrencyManagerVATMode ( Form ) export

	object = Form.Object;
	fields = "Currency, SupplyManager, VATMode, Import";
	data = DF.Values ( object.Contract, fields );
	object.Currency = data.Currency;
	object.Manager = data.SupplyManager;
	object.VATMode = data.VATMode;
	object.Import = data.Import;
	Form.ContractCurrency = data.Currency;
	
EndProcedure

&AtServer
Procedure SetCustomerDepositsContactManagerVATRate ( Object ) export
	
	fields = "OrganizationDeposit, Deposit, Contact, SalesManager, TaxGroup";
	data = DF.Values ( Object.Contract, fields );
	setObjectFields ( Object, "Customer", fields, data );
	
EndProcedure

&AtClient
Procedure SetWarehouseDeliveryAddress ( Object ) export
	
	fields = "Address";
	data = DF.Values ( Object.Warehouse, "Address" );
	setObjectFields ( Object, "WarehouseAddress", fields, data );
	
EndProcedure

&AtServer
Procedure SetVendorDeposits ( Object ) export
	
	setDeposits ( Object, "Vendor" );
	
EndProcedure

&AtServer
Procedure SetCustomerDeposits ( Object ) export
	
	setDeposits ( Object, "Customer" );
	
EndProcedure

&AtServer
Procedure setDeposits ( Object, DocumentClass )
	
	fields = "OrganizationDeposit, Deposit";
	data = DF.Values ( Object.Contract, fields );
	setObjectFields ( Object, DocumentClass, fields, data );
	
EndProcedure

Procedure setObjectFields ( Object, FieldsType, Fields, DataFields )
	
	fieldsArray = Conversion.StringToArray ( Fields );
	for each field in fieldsArray do
		fieldValue = DataFields [ field ];
		if ( not ValueIsFilled ( fieldValue ) ) then
			continue;
		endif; 
		if ( field = "OrganizationDeposit" ) then
			if ( FieldsType = "Customer" ) then
				Object.CustomerDeposit = fieldValue;
			else
				Object.VendorDeposit = fieldValue;
			endif; 
		elsif ( field = "SupplyManager" ) or ( field = "SalesManager" ) then
			Object.Manager = fieldValue;
		else
			Object [ field ] = fieldValue;
		endif; 
	enddo; 

EndProcedure
